In [2]:
# Importación de librerías básicas
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Importar TODAS las funciones del toolbox
import toolbox_ML as tb

In [3]:
# Cargar dataset
df = pd.read_csv("Titanic.csv")

# Primer vistazo
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
# Resumen del DataFrame
tb.describe_df(df)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
data_type,int64,int64,object,float64,int64,int64,float64,object,object,object,bool,object,object,object,bool
missing_%,0.0,0.0,0.0,19.86532,0.0,0.0,0.0,0.224467,0.0,0.0,0.0,77.216611,0.224467,0.0,0.0
unique_values,2,3,2,88,7,7,248,3,3,3,2,7,3,2,2
cardin_%,0.224467,0.3367,0.224467,9.876543,0.785634,0.785634,27.833895,0.3367,0.3367,0.3367,0.224467,0.785634,0.3367,0.224467,0.224467

In [5]:
tb.tipifica_variables(df, umbral_categoria=10, umbral_continua=0.05)

   nombre_variable      tipo_sugerido
0         survived            Binaria
1           pclass         Categórica
2              sex            Binaria
3              age  Numerica Continua
4            sibsp         Categórica
5            parch         Categórica
6             fare  Numerica Continua
7         embarked         Categórica
8            class         Categórica
9              who         Categórica
10      adult_male            Binaria
11            deck         Categórica
12     embark_town         Categórica
13           alive            Binaria
14           alone            Binaria

In [7]:
tb.get_features_num_regression(df, target_col="fare", umbral_corr=0.2)

['survived', 'pclass', 'parch']

In [11]:
tb.get_features_num_regression(df, target_col="fare", umbral_corr=0.2, pvalue=0.05)

['survived', 'pclass', 'parch']